Tekla.Structures.Drawing.PlacingQuarterAttributes
The PlacingQuarterAttributes class contains the basic attributes for placing quarters.

Tekla.Structures.Drawing.PlacingQuarterAttributes.TopLeft
Defines whether the object can search for a suitable location in the top left direction.

Tekla.Structures.Drawing.PlacingQuarterAttributes.TopRight
Defines whether the object can search for a suitable location in the top right direction.

Tekla.Structures.Drawing.PlacingQuarterAttributes.BottomLeft
Defines whether the object can search for a suitable location in the bottom left direction.

Tekla.Structures.Drawing.PlacingQuarterAttributes.BottomRight
Defines whether the object can search for a suitable location in the bottom right direction.

Tekla.Structures.Drawing.PlacingQuarterAttributes.#ctor
Creates a new placing quarter attributes instance. The default parameters are:
TopLeft = true, TopRight = true, BottomLeft = true, BottomRight = true.

Tekla.Structures.Drawing.PlacingQuarterAttributes.#ctor(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Creates a new placing quarter attributes instance with the given parameters.
TopLeft:
Defines whether the object can search for a suitable location in the top left direction.
TopRight:
Defines whether the object can search for a suitable location in the top right direction.
BottomLeft:
Defines whether the object can search for a suitable location in the bottom left direction.
BottomRight:
Defines whether the object can search for a suitable location in the bottom right direction.

Tekla.Structures.Drawing.PlacingQuarterAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PlacingQuarterAttributes.Clone
Creates a new object that is a copy of the current instance.
Returns:
A new object that is a copy of the current instance.
2